fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/ВКМ_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикРаботы</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НачалоПериода = НачалоМесяца(Дата);
	КонецПериода = КонецМесяца(Дата);
	
	Для Каждого СтрокаНачисления Из Начисления Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаНачисления.ДатаНачала)
			Или Не ЗначениеЗаполнено(СтрокаНачисления.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Начисления",
			СтрокаНачисления.НомерСтроки, "ДатаНачала");
		
		Если СтрокаНачисления.ДатаНачала > СтрокаНачисления.ДатаОкончания Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Строка %1: дата начала больше даты окончания.'"),
					СтрокаНачисления.НомерСтроки),
				ЭтотОбъект, Поле, , Отказ);
		ИначеЕсли СтрокаНачисления.ДатаНачала < НачалоПериода
			Или СтрокаНачисления.ДатаОкончания > КонецПериода Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Строка %1: период начисления должен быть в пределах месяца документа.'"),
					СтрокаНачисления.НомерСтроки),
				ЭтотОбъект, Поле, , Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	ВКМ_ЗарплатаСервер.ЗаполнитьГрафикРаботы(ДобавитьМесяц(ПериодРегистрации, -12), КонецГода(Дата));
	
	СформироватьОсновныеНачисления(ПериодРегистрации);
	РассчитатьОклад(ПериодРегистрации);
	РассчитатьОтпуск(ПериодРегистрации);
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	СформироватьДополнительныеНачисления(ПериодРегистрации);
	
	НаборыНачислений = Новый Массив;
	НаборыНачислений.Добавить(Движения.ВКМ_ОсновныеНачисления);
	НаборыНачислений.Добавить(Движения.ВКМ_ДополнительныеНачисления);
	ВКМ_ЗарплатаСервер.СформироватьНДФЛ(Движения.ВКМ_Удержания, НаборыНачислений, ПериодРегистрации);
	ВКМ_ЗарплатаСервер.СформироватьВзаиморасчеты(Движения.ВКМ_ВзаиморасчетыССотрудниками,
		НаборыНачислений, Движения.ВКМ_Удержания, Дата);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьОсновныеНачисления(ПериодРегистрации)
	
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	
	Для Каждого СтрокаНачисления Из Начисления Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ВидРасчета = СтрокаНачисления.ВидРасчета;
		Движение.Сотрудник = СтрокаНачисления.Сотрудник;
		Движение.ПериодДействияНачало = НачалоДня(СтрокаНачисления.ДатаНачала);
		Движение.ПериодДействияКонец = КонецДня(СтрокаНачисления.ДатаОкончания);
		Движение.БазовыйПериодНачало = ДобавитьМесяц(ПериодРегистрации, -12);
		Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(ПериодРегистрации, -1));
	КонецЦикла;
	
	// Запись нужна, чтобы платформа рассчитала фактический период действия (вытеснение).
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры

Процедура РассчитатьОклад(ПериодРегистрации)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(Условия.Оклад, 0) КАК Оклад,
	|	ЕСТЬNULL(График.ЗначениеФактическийПериодДействия, 0) КАК ОтработаноДней
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	|				Регистратор = &Ссылка
	|					И ВидРасчета = &Оклад) КАК График
	|		ПО Начисления.НомерСтроки = График.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&КонецПериода) КАК Условия
	|		ПО Начисления.Сотрудник = Условия.Сотрудник
	|ГДЕ
	|	Начисления.Регистратор = &Ссылка
	|	И Начисления.ВидРасчета = &Оклад";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодРегистрации));
	
	НормаДней = ВКМ_ЗарплатаСервер.КоличествоРабочихДней(ПериодРегистрации, КонецМесяца(ПериодРегистрации));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Если НормаДней = 0 Тогда
			Движение.Результат = 0;
		Иначе
			Движение.Результат = Окр(Выборка.Оклад * Выборка.ОтработаноДней / НормаДней, 2);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьОтпуск(ПериодРегистрации)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	РАЗНОСТЬДАТ(Начисления.ПериодДействияНачало, Начисления.ПериодДействияКонец, ДЕНЬ) + 1 КАК ДнейОтпуска,
	|	ЕСТЬNULL(БазаОсновные.РезультатБаза, 0) + ЕСТЬNULL(БазаДополнительные.РезультатБаза, 0) КАК База
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
	|				&Измерения,
	|				&Измерения,
	|				&Разрезы,
	|				Регистратор = &Ссылка
	|					И ВидРасчета = &Отпуск) КАК БазаОсновные
	|		ПО Начисления.НомерСтроки = БазаОсновные.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(
	|				&Измерения,
	|				&Измерения,
	|				&Разрезы,
	|				Регистратор = &Ссылка
	|					И ВидРасчета = &Отпуск) КАК БазаДополнительные
	|		ПО Начисления.НомерСтроки = БазаДополнительные.НомерСтроки
	|ГДЕ
	|	Начисления.Регистратор = &Ссылка
	|	И Начисления.ВидРасчета = &Отпуск";
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Разрезы = Новый Массив;
	Разрезы.Добавить("НомерСтроки");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Разрезы", Разрезы);
	
	РабочихДнейЗаГод = ВКМ_ЗарплатаСервер.КоличествоРабочихДней(
		ДобавитьМесяц(ПериодРегистрации, -12), КонецМесяца(ДобавитьМесяц(ПериодРегистрации, -1)));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Если РабочихДнейЗаГод = 0 Тогда
			Движение.Результат = 0;
		Иначе
			Движение.Результат = Окр(Выборка.База / РабочихДнейЗаГод * Выборка.ДнейОтпуска, 2);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДополнительныеНачисления(ПериодРегистрации)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Обороты.Сотрудник КАК Сотрудник,
	|	Обороты.СуммаКОплатеОборот КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Сотрудник В (&Сотрудники)) КАК Обороты";
	Запрос.УстановитьПараметр("НачалоПериода", ПериодРегистрации);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Сотрудники", Начисления.ВыгрузитьКолонку("Сотрудник"));
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентОтРабот;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Результат = Выборка.Сумма;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
